addons/l10n_my_edi/tests/files/invoice.xml

<Invoice xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2" xmlns="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2" xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2">
  <cbc:ID>INV/2024/0001</cbc:ID>
  <cbc:IssueDate>2024-07-22</cbc:IssueDate>
  <cbc:IssueTime>03:08:04Z</cbc:IssueTime>
  <cbc:InvoiceTypeCode listVersionID="1.1">01</cbc:InvoiceTypeCode>
  <cbc:DocumentCurrencyCode>MYR</cbc:DocumentCurrencyCode>
  <cac:AdditionalDocumentReference>
    <cbc:ID>1356487</cbc:ID>
    <cbc:DocumentType>CustomsImportForm</cbc:DocumentType>
  </cac:AdditionalDocumentReference>
  <cac:AdditionalDocumentReference>
    <cbc:ID>CPT</cbc:ID>
  </cac:AdditionalDocumentReference>
  <cac:AccountingSupplierParty>
    <cac:Party>
      <cbc:IndustryClassificationCode name="Growing of maize">01111</cbc:IndustryClassificationCode>
      <cac:PartyIdentification>
        <cbc:ID schemeID="TIN">C58621197045</cbc:ID>
      </cac:PartyIdentification>
      <cac:PartyIdentification>
        <cbc:ID schemeID="BRN">202001234567</cbc:ID>
      </cac:PartyIdentification>
      <cac:PartyIdentification>
        <cbc:ID schemeID="SST">A01-2345-67891012</cbc:ID>
      </cac:PartyIdentification>
      <cac:PartyIdentification>
        <cbc:ID schemeID="TTX">123-4567-89012345</cbc:ID>
      </cac:PartyIdentification>
      <cac:PartyName>
        <cbc:Name>My Test Company</cbc:Name>
      </cac:PartyName>
      <cac:PostalAddress>
        <cbc:CityName>Kuala Lumpur</cbc:CityName>
        <cbc:PostalZone>50300</cbc:PostalZone>
        <cbc:CountrySubentity>Kuala Lumpur</cbc:CountrySubentity>
        <cbc:CountrySubentityCode>14</cbc:CountrySubentityCode>
        <cac:AddressLine>
          <cbc:Line>1 Wisma Dato Dagang</cbc:Line>
        </cac:AddressLine>
        <cac:AddressLine>
          <cbc:Line>Jln Raja Alang Kampung Bahru Mala</cbc:Line>
        </cac:AddressLine>
        <cac:Country>
          <cbc:IdentificationCode listID="ISO3166-1" listAgencyID="6">MYS</cbc:IdentificationCode>
          <cbc:Name>Malaysia</cbc:Name>
        </cac:Country>
      </cac:PostalAddress>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>My Test Company</cbc:RegistrationName>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:ID>41</cbc:ID>
        <cbc:Name>My Test Company</cbc:Name>
        <cbc:Telephone>+60123456789</cbc:Telephone>
        <cbc:ElectronicMail>info@company.myexample.com</cbc:ElectronicMail>
      </cac:Contact>
    </cac:Party>
  </cac:AccountingSupplierParty>
  <cac:AccountingCustomerParty>
    <cac:Party>
      <cac:PartyIdentification>
        <cbc:ID schemeID="TIN">C58621197050</cbc:ID>
      </cac:PartyIdentification>
      <cac:PartyIdentification>
        <cbc:ID schemeID="BRN">202001234567</cbc:ID>
      </cac:PartyIdentification>
      <cac:PartyName>
        <cbc:Name>Deco Addict</cbc:Name>
      </cac:PartyName>
      <cac:PostalAddress>
        <cbc:CityName>Kuala Lumpur</cbc:CityName>
        <cbc:PostalZone>50480</cbc:PostalZone>
        <cbc:CountrySubentity>Kuala Lumpur</cbc:CountrySubentity>
        <cbc:CountrySubentityCode>14</cbc:CountrySubentityCode>
        <cac:AddressLine>
          <cbc:Line>Bangunan Merdeka</cbc:Line>
        </cac:AddressLine>
        <cac:AddressLine>
          <cbc:Line>Persiaran Jaya</cbc:Line>
        </cac:AddressLine>
        <cac:Country>
          <cbc:IdentificationCode listID="ISO3166-1" listAgencyID="6">MYS</cbc:IdentificationCode>
          <cbc:Name>Malaysia</cbc:Name>
        </cac:Country>
      </cac:PostalAddress>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>Deco Addict</cbc:RegistrationName>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:ID>10</cbc:ID>
        <cbc:Name>Deco Addict</cbc:Name>
        <cbc:Telephone>+60123456789</cbc:Telephone>
        <cbc:ElectronicMail>deco_addict@yourcompany.example.com</cbc:ElectronicMail>
      </cac:Contact>
    </cac:Party>
  </cac:AccountingCustomerParty>
  <cac:Delivery>
    <cac:DeliveryParty>
      <cac:PartyIdentification>
        <cbc:ID schemeID="TIN">C2584563200</cbc:ID>
      </cac:PartyIdentification>
      <cac:PartyIdentification>
        <cbc:ID schemeID="BRN">202001234567</cbc:ID>
      </cac:PartyIdentification>
      <cac:PostalAddress>
        <cbc:CityName>Kuala Lumpur</cbc:CityName>
        <cbc:PostalZone>50480</cbc:PostalZone>
        <cbc:CountrySubentity>Kuala Lumpur</cbc:CountrySubentity>
        <cbc:CountrySubentityCode>14</cbc:CountrySubentityCode>
        <cac:AddressLine>
          <cbc:Line>Bangunan Merdeka</cbc:Line>
        </cac:AddressLine>
        <cac:AddressLine>
          <cbc:Line>Persiaran Jaya</cbc:Line>
        </cac:AddressLine>
        <cac:Country>
          <cbc:IdentificationCode listID="ISO3166-1" listAgencyID="6">MYS</cbc:IdentificationCode>
          <cbc:Name>Malaysia</cbc:Name>
        </cac:Country>
      </cac:PostalAddress>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>Deco Addict</cbc:RegistrationName>
      </cac:PartyLegalEntity>
    </cac:DeliveryParty>
  </cac:Delivery>
  <cac:TaxTotal>
    <cbc:TaxAmount currencyID="MYR">14.70</cbc:TaxAmount>
    <cac:TaxSubtotal>
      <cbc:TaxableAmount currencyID="MYR">147.00</cbc:TaxableAmount>
      <cbc:TaxAmount currencyID="MYR">0.00</cbc:TaxAmount>
      <cbc:Percent>6.0</cbc:Percent>
      <cac:TaxCategory>
        <cbc:ID>E</cbc:ID>
        <cbc:Name>Exempt for reason</cbc:Name>
        <cbc:Percent>6.0</cbc:Percent>
        <cbc:TaxExemptionReason>Exempt for reason</cbc:TaxExemptionReason>
        <cac:TaxScheme>
          <cbc:ID schemeID="UN/ECE 5153" schemeAgencyID="6">OTH</cbc:ID>
        </cac:TaxScheme>
      </cac:TaxCategory>
    </cac:TaxSubtotal>
    <cac:TaxSubtotal>
      <cbc:TaxableAmount currencyID="MYR">147.00</cbc:TaxableAmount>
      <cbc:TaxAmount currencyID="MYR">14.70</cbc:TaxAmount>
      <cbc:Percent>10.0</cbc:Percent>
      <cac:TaxCategory>
        <cbc:ID>01</cbc:ID>
        <cbc:Percent>10.0</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID schemeID="UN/ECE 5153" schemeAgencyID="6">OTH</cbc:ID>
        </cac:TaxScheme>
      </cac:TaxCategory>
    </cac:TaxSubtotal>
  </cac:TaxTotal>
  <cac:LegalMonetaryTotal>
    <cbc:LineExtensionAmount currencyID="MYR">147.00</cbc:LineExtensionAmount>
    <cbc:TaxExclusiveAmount currencyID="MYR">147.00</cbc:TaxExclusiveAmount>
    <cbc:TaxInclusiveAmount currencyID="MYR">161.70</cbc:TaxInclusiveAmount>
    <cbc:PrepaidAmount currencyID="MYR">0.00</cbc:PrepaidAmount>
    <cbc:PayableAmount currencyID="MYR">161.70</cbc:PayableAmount>
  </cac:LegalMonetaryTotal>
  <cac:InvoiceLine>
    <cbc:ID>1</cbc:ID>
    <cbc:InvoicedQuantity unitCode="C62">1.0</cbc:InvoicedQuantity>
    <cbc:LineExtensionAmount currencyID="MYR">147.00</cbc:LineExtensionAmount>
    <cac:TaxTotal>
      <cbc:TaxAmount currencyID="MYR">14.70</cbc:TaxAmount>
      <cac:TaxSubtotal>
        <cbc:TaxableAmount currencyID="MYR">147.00</cbc:TaxableAmount>
        <cbc:TaxAmount currencyID="MYR">0.00</cbc:TaxAmount>
        <cbc:Percent>6.0</cbc:Percent>
        <cac:TaxCategory>
          <cbc:ID>E</cbc:ID>
          <cbc:Name>Exempt for reason</cbc:Name>
          <cbc:Percent>6.0</cbc:Percent>
          <cbc:TaxExemptionReason>Exempt for reason</cbc:TaxExemptionReason>
          <cac:TaxScheme>
            <cbc:ID schemeID="UN/ECE 5153" schemeAgencyID="6">OTH</cbc:ID>
          </cac:TaxScheme>
        </cac:TaxCategory>
      </cac:TaxSubtotal>
      <cac:TaxSubtotal>
        <cbc:TaxableAmount currencyID="MYR">147.00</cbc:TaxableAmount>
        <cbc:TaxAmount currencyID="MYR">14.70</cbc:TaxAmount>
        <cbc:Percent>10.0</cbc:Percent>
        <cac:TaxCategory>
          <cbc:ID>01</cbc:ID>
          <cbc:Percent>10.0</cbc:Percent>
          <cac:TaxScheme>
            <cbc:ID schemeID="UN/ECE 5153" schemeAgencyID="6">OTH</cbc:ID>
          </cac:TaxScheme>
        </cac:TaxCategory>
      </cac:TaxSubtotal>
    </cac:TaxTotal>
    <cac:Item>
      <cbc:Description>[E-COM06] Corner Desk Right Sit</cbc:Description>
      <cbc:Name>Corner Desk Right Sit</cbc:Name>
      <cac:SellersItemIdentification>
        <cbc:ID>E-COM06</cbc:ID>
      </cac:SellersItemIdentification>
      <cac:CommodityClassification>
        <cbc:ItemClassificationCode listID="CLASS">012</cbc:ItemClassificationCode>
      </cac:CommodityClassification>
      <cac:ClassifiedTaxCategory>
        <cbc:ID>E</cbc:ID>
        <cbc:Name>Exempt for reason</cbc:Name>
        <cbc:Percent>6.0</cbc:Percent>
        <cbc:TaxExemptionReason>Exempt for reason</cbc:TaxExemptionReason>
        <cac:TaxScheme>
          <cbc:ID schemeID="UN/ECE 5153" schemeAgencyID="6">OTH</cbc:ID>
        </cac:TaxScheme>
      </cac:ClassifiedTaxCategory>
      <cac:ClassifiedTaxCategory>
        <cbc:ID>01</cbc:ID>
        <cbc:Percent>10.0</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID schemeID="UN/ECE 5153" schemeAgencyID="6">OTH</cbc:ID>
        </cac:TaxScheme>
      </cac:ClassifiedTaxCategory>
    </cac:Item>
    <cac:Price>
      <cbc:PriceAmount currencyID="MYR">147.0</cbc:PriceAmount>
    </cac:Price>
  </cac:InvoiceLine>
</Invoice>
